README.md
```mermaid
erDiagram
    note {
        path TEXT
    }
    link {
        from TEXT
        to TEXT
    }
    property {
        note TEXT
        key TEXT
        value TEXT
    }
    task {
        note TEXT
        status TEXT
        content TEXT
        due_date TEXT
        done_date TEXT
    }

    link 1 -- 1 note : "from"
    link 1 -- 1 note : "to"
    property zero or more -- 1 note : note
    task zero or more -- 1 note : note
```
